_posts/2017-7-6-permutation.html
---
layout: post
title: 排列相关的题目
excerpt: 关于全排列的题目
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 排列</h2>
<div class="outline-text-2" id="text-1">
<p>
  关于排列的题目可以用C++中的 <code>next_premutation</code>,这个函数返回比当前排列 <b>大</b> 的下一个排列,要得到全排列,一般先将数组从小
到大排序,然后使用 <code>next_permutaion</code>.
</p>
<pre class="example">
vector&lt;int&gt; nums = {2,3,1,5,4};
sort(nums.begin(), nums.end());
do{
    dosomething
} while(next_premutation(nums.begin(), nums.end()));
</pre>

<p>
具体排列的原理用之后的题介绍
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 生成全排列</h2>
<div class="outline-text-2" id="text-2">
<p>
Leetcode 46: Given a collection of <b>distinct</b> numbers, return all possible permutations.
</p>

<p>
  可以用STL中的next_premutation来解,自己的解法分为递归和非递归.递归解法比较直观,
n个数的全排列可以分解为:第一个数为k,剩下的n-1个数的全排列.
</p>
<pre class="example">
next_premutation(nums,i){
    if(i==nums.size()-1) ...;
    for(int i=k;i&lt;nums.size();i++){
        swap(nums[i],num[k]);
        next_premutation(nums,i+1);
        swap(nums[i],nums[k]);
    }
}
</pre>

<p>
计算时间复杂度:
$$T(n) = nT(n-1)+\Theta(n)$$
令$$G(n)=\frac{T(n)}{n!}$$
$$G(n) = G(n-1) + \Theta(\frac{1}{(n-1)!})$$
所以:
$$G(n) = \Theta(1)$$
$$T(n)=\Theta(n!)$$
</p>

<p>
全排列一共 \(n!\) ,所以时间复杂度应该满足 \(\Omega(n!)\) .
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 有重复元素的全排列</h2>
<div class="outline-text-2" id="text-3">
<p>
LeetCode 47: Given a collection of numbers that might contain duplicates, return all possible unique permutations.
</p>

<p>
同样可以用 <code>next_permutaion</code> .
</p>

<p>
递归方法需要判断要交换的值是否相等.
</p>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 下一个排列</h2>
<div class="outline-text-2" id="text-4">
<p>
LeetCode 31:
</p>

<p>
Implement next permutation, which rearranges numbers into the lexicographically next greater permutation of numbers.
</p>

<p>
If such arrangement is not possible, it must rearrange it as the lowest possible order (ie, sorted in ascending order).
</p>

<p>
The replacement must be in-place, do not allocate extra memory.
</p>

<p>
Here are some examples. Inputs are in the left-hand column and its corresponding outputs are in the right-hand column.
</p>

<p>
1,2,3 -&gt; 1,3,2
</p>

<p>
3,2,1 -&gt; 1,2,3
</p>

<p>
1,1,5 -&gt; 1,5,1
</p>

<p>
要得到下一个排列,可以观察我们需要找出尾部的递减序列, 例如对于 \((1,3,5,4,2)\) ,最后的 \((5,4,2)\) 是一个递减序列,不能从这个子序列中
得到比他大的下一个序列, 3比5小,我们用3和 \((5,4,2)\) 中刚好比3大的数交换,这个数就是4,这时变成了 \((5,3,2)\) 这个递减的序列,我们再
把这个序列翻转成 \((2,3,5)\) ,最后得到 \((1,4,2,3,5)\) .
</p>

<p>
平均时间复杂度:
$$T(n) = \Theta(n)$$
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 得到第k个排列</h2>
<div class="outline-text-2" id="text-5">
<p>
LeetCode 60:
</p>

<p>
The set <code>[1,2,3,…,n]</code> contains a total of n! unique permutations.
</p>

<p>
By listing and labeling all of the permutations in order,
We get the following sequence (ie, for n = 3):
</p>
<ol class="org-ol">
<li>"123"
</li>
<li>"132"
</li>
<li>"213"
</li>
<li>"231"
</li>
<li>"312"
</li>
<li>"321"
</li>
</ol>

<p>
Given \(n\) and \(k\), return the \(k^{th}\) permutation sequence.
</p>

<p>
\(n\) 个数有 \(n!\) 个排列, 我们考虑第 \(k\) 个排列的第一位, 任何一个数开始,都可以有 \((n-1)!\) 个排列,所以我们可以通过 \(k/(n-1)!\) 来确定第一位的数字,确定了之后,我们找出剩下数字的 \(k%(n-1)!\) 排列并接在后面, 这里的主要问题在算法比较直观,实现上比较麻烦, 可以用 \(O(n)\) 的空间实现
</p>

<p>
比如:
$$n=3,k=3$$
初始化 \(s\)
$$s="123"$$
计算第一个位置的值:
$$\frac{3}{2!} = 1$$
交换位置0和位置1的值,并保证1到 \(n\) 升序:
$$s="213"$$
继续到结尾.
</p>

<p>
时间复杂度:
$$T(n) = T(n-1) + \Theta(n)$$
$$T(n) = \Theta(n^2)$$
</p>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 已知一个排列实例,求它的序号</h2>
<div class="outline-text-2" id="text-6">
<p>
和上面的问题相反,假设已知一个排列,求这个排列在全排列中的序号.
</p>

<p>
过程与上面相反,假设第一位是m,剩下的 \(n-1\) 位全排列是 \((n-1)!\) , 则总的个数为:
$$ permutaionNumber(nums, n)=(nums[n]-1)*(n-1)! + permutaionNumber(nums, n-1) $$
可以用递归或循环的方式实现.
</p>

<p>
时间复杂度:
$$T(n) = T(n-1) + c$$
$$T(n) = \Theta(n)$$
</p>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Shuffle an Array</h2>
<div class="outline-text-2" id="text-7">
<p>
打乱数组,全排列中每一个排列出现的概率相等,可参考算法导论第五章,RANDOM-IN-PLACE方法:
</p>
<pre class="example">
RANDOMIZE-IN-PLACE(A)
n = A.length
for i=1 to n
  swap A[i] with A[RANDOM(i,n)]
</pre>

<p>
时间复杂度 \(\Theta(n)\)
</p>
</div>
</div>
